app/controllers/payments_controller.rb

  def create
    payment = Payment.new payment_params
    if payment.save
---
INSERT INTO `payments` (`payment_method_id`, `quantity`, `customer_id`, `customer_type`, `user_id`, `created_at`, `updated_at`) VALUES (1, 2, 1, 'Collection', 1, '2015-11-27 17:56:59', '2015-11-27 17:56:59')

  def show
    @payment = Payment.find_by_transaction_id! params[:id]
---
SELECT  `payments`.* FROM `payments` WHERE `payments`.`transaction_id` = '7HV142360V573164M' LIMIT 1